NumPy is ideal for numerical and matrix operations on raw data.

Pandas is best for data manipulation and analysis, especially when working with tabular data that has rows and columns.

In [1]:
import pandas as pd

In [4]:
data = {
    "Name" : "Ridwan Ahmed Arman",
    "Age" : 24,
    "Gender" : "Male",
    "City" : "Kathmandu",
    "Subject" : ["Machine Learning", "Deep Learning", "Data Science"],
    "Gpa" : [3.5, 4.0, 3.8]
}

print(data)

df = pd.DataFrame(data)
print(df)

{'Name': 'Ridwan Ahmed Arman', 'Age': 24, 'Gender': 'Male', 'City': 'Kathmandu', 'Subject': ['Machine Learning', 'Deep Learning', 'Data Science'], 'Gpa': [3.5, 4.0, 3.8]}
                 Name  Age Gender       City           Subject  Gpa
0  Ridwan Ahmed Arman   24   Male  Kathmandu  Machine Learning  3.5
1  Ridwan Ahmed Arman   24   Male  Kathmandu     Deep Learning  4.0
2  Ridwan Ahmed Arman   24   Male  Kathmandu      Data Science  3.8

In [5]:
df.to_csv("result.csv", index=False) # index=False will remove the index column

In [10]:
pd.read_csv("result.csv")

                 Name  Age Gender       City           Subject  Gpa
0  Ridwan Ahmed Arman   24   Male  Kathmandu  Machine Learning  3.5
1  Ridwan Ahmed Arman   24   Male  Kathmandu     Deep Learning  4.0
2  Ridwan Ahmed Arman   24   Male  Kathmandu      Data Science  3.8

In [6]:
df.head()

                 Name  Age Gender       City           Subject  Gpa
0  Ridwan Ahmed Arman   24   Male  Kathmandu  Machine Learning  3.5
1  Ridwan Ahmed Arman   24   Male  Kathmandu     Deep Learning  4.0
2  Ridwan Ahmed Arman   24   Male  Kathmandu      Data Science  3.8

In [7]:
df.describe()

        Age       Gpa
count   3.0  3.000000
mean   24.0  3.766667
std     0.0  0.251661
min    24.0  3.500000
25%    24.0  3.650000
50%    24.0  3.800000
75%    24.0  3.900000
max    24.0  4.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Age      3 non-null      int64
 2   Gender   3 non-null      object
 3   City     3 non-null      object
 4   Subject  3 non-null      object
 5   Gpa      3 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 272.0+ bytes

In [11]:
df["Gpa"] > 3.5

0    False
1     True
2     True
Name: Gpa, dtype: bool

In [12]:
df[df["Gpa"] > 3.5]

                 Name  Age Gender       City        Subject  Gpa
1  Ridwan Ahmed Arman   24   Male  Kathmandu  Deep Learning  4.0
2  Ridwan Ahmed Arman   24   Male  Kathmandu   Data Science  3.8

In [13]:
df["Subject"].value_counts()

Subject
Machine Learning    1
Deep Learning       1
Data Science        1
Name: count, dtype: int64

In [14]:
df.isnull()

    Name    Age  Gender   City  Subject    Gpa
0  False  False   False  False    False  False
1  False  False   False  False    False  False
2  False  False   False  False    False  False